#ifndef _TITLE_PRESS_BUTTON_H_
#define _TITLE_PRESS_BUTTON_H_
//=========================================================================
// タイトルPress_Button [title_press_button.h]
// Author : SugawaraTsukasa
//=========================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "scene2d.h"

//=========================================================================
// 前方宣言
//=========================================================================

//=========================================================================
// クラス定義
//=========================================================================
class CTitlePress_Button : public CScene2D
{
public:
	CTitlePress_Button(PRIORITY = PRIORITY_UI);	// コンストラクタ
	~CTitlePress_Button();						// デストラクタ

	static CTitlePress_Button *Create(void);		// インスタンス生成
	HRESULT Init(void);						// 初期化処理
	void Update(void);						// 更新処理
	void Draw(void);						// 描画処理
private:
	bool m_bColor;	// 色の判定
};

#endif